app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-05-20 18:13:47.739706"], ["updated_at", "2019-05-20 18:13:47.739706"]]
---
  def create
    @student = Student.create({
      first_name: params[:first_name],
      last_name: params[:last_name]
      })

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-05-20 18:13:47.802887"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])

    if(@student.update({
      first_name: params[:first_name],
      last_name: params[:last_name]
      }))